taylor_couette/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
65536
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;

boundaryField
{
    innerWall
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    outerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
512
(
(-2.80415e-19 -4.56999e-17 12657.6)
(-1.25981e-17 -6.84311e-16 12657.6)
(-4.50946e-17 -1.4694e-15 12657.6)
(3.63164e-17 8.45002e-16 12657.6)
(-2.32154e-17 -4.19964e-16 12657.6)
(-1.64648e-17 -2.4357e-16 12657.6)
(-1.09708e-16 -1.37244e-15 12657.6)
(-1.38981e-16 -1.50576e-15 12657.6)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
