taylor_couette/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     myicoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.001;

adjustTimeStep  yes;  // automatically set the Courant number

maxCo           0.8;  // limit maximum Courant number

maxDeltaT       0.001; // Maximum timeStep between simulations

writeControl    adjustableRunTime; // timeStep; or adjustableRunTime;

writeInterval   1; 

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
  #includeFunc residuals

  #includeFunc vorticity(U)
}


// ************************************************************************* //
